class Questions {

  final String word;
  final Map<String, bool> answers;

  Questions(this.word, this.answers);

}

  final questions = [
   Questions('мяо-яо',
       {
         'рисовое поле во Вьетнаме':false,
         'один из народов Полинезии':false,
         'группа языков в Юго-Восточной Азии':true

   }),

    Questions('гарупсики',
        {
          'жрецы, гадавшие по внутренностям жертвенных животных':true,
          'наскльные надписи времён верхнего палеолита':false,
          'первые толковые словари английского языка':false

        }),

    Questions('имбибиция',
        {
          'процедура проритывания в медицине':true,
          'неправильное расположение ресниц':false,
          'древнеримская ваза':false

        }),

    Questions('шапокляк',
        {
          'складная шляпа-цилиндр на пружинах':true,
          'продолговатая дамская сумочка с защёлкой':false,
          'настольный чернильный прибор':false

        }),

    Questions('шассе',
        {
          'направление роликового транспортёра в боулинге':false,
          'механизм крепления грузовых прицепов':false,
          'сочетание трёх скользящих шагов в бальном танце':true

        }),

    Questions('библьдрук',
        {
          'сорт очень тонкой типографской бумаги':true,
          'исследователь Священного Писания':false,
          'запорный механизм башенного крана':false

        }),

    Questions('монокок',
        {
          'тип пространственной конструкции':true,
          'один из видов шаровидной бактерии':false,
          'старший повар на корабле':false

        }),

    Questions('ктырь',
        {
          'полудрагоценный камень':false,
          'гвоздь с зазубренным концом':false,
          'насекомое отряда двукрылых':true

        }),

    Questions('шнява',
        {
          'бурдюк для створаживания конского молока':false,
          'небольшое двухмачтовое судно':true,
          'временная партнёрша для языческих хороводных танцев':false

        }),

    Questions('штыб',
        {
          'мелкий или измельчённыйкаменный уголь':true,
          'прямой короткий удар кулаком в бою':false,
          'едкий стелющийся дым при лесных пожарах':false

        }),

    Questions('цуйка',
        {
          'фруктовая водка у румын и молдован':true,
          'мелкий вальдшнеп':false,
          'скоряжная игла':false

        }),

    Questions('терпентин',
        {
          'смолистая густая масса':true,
          'сплав олова и сурьмы':false,
          'средство для подавления чувства голода в экстремальных условиях':false

        }),

    Questions('сюрпляс',
        {
          'помещение для боеприпасов на судне':false,
          'эстрадная чечётка':false,
          'стартовое положение велосипеда в трековых гонках':true

        }),

    Questions('зензубель',
        {
          'пресмыкающееся отряда ящеровидніх динозавров':false,
          'стиотворный размер':false,
          'рубанок для строгания фасонныъ поверхностей':true

        }),

    Questions('дупель',
        {
          'болотная птица с длинным тонким клювом':true,
          'состояние сильного алкогольного опьянения':false,
          'вид удара в бильярде':false

        }),

    Questions('ююба',
        {
          'колючий кустарник':true,
          'культурное сооружение тунгусов':false,
          'гигантский термитник':false

        }),

    Questions('анкерок',
        {
          'деревянный бочонок для воды в шлюпках':true,
          'деталь часового механизма':false,
          'курсант военного училища':false

        }),

    Questions('дуранда',
        {
          'нигерийская мера веса':false,
          'остатки семян масличных растений после выжимания масла':true,
          'южноафриканский сухой кустарник':false

        }),

    Questions('жарарака',
        {
          'ядовитая южноамериканская змея':true,
          'большой амазонский тукан':false,
          'вёсельная лодка с навесом':false

        }),

    Questions('ёхор',
        {
          'бурятский народный хороводный танец':true,
          'топор с удлинённым топорищем':false,
          'странность, причуда':false

        }),

    Questions('ерундопель',
        {
          'зверёк семейства беличьих':false,
          'несерьёзный человек':false,
          'салат из икры, рыбы и овощей':true

        }),

    Questions('бабирусса',
        {
          'мароканский чечевичный суп':false,
          'документ раннеславянсой письменности':false,
          'млекопитающее семейства свиней':true

        }),

    Questions('инквартата',
        {
          'интервал в музыке':false,
          'средство для водной переправы':false,
          'уклонение от удара противника в фехтовании':true

        }),

    Questions('интима',
        {
          'внутренняя оболочка стенки кровеносных сосудов':true,
          'минимальное расстояние между партнёрами в танце':false,
          'расплавленная горная порода':false

        }),

    Questions('йох',
        {
          'мера пахотной земли в странах Центральной Европы':true,
          'серый тюлень':false,
          'большой цилиндрический барабан':false

        }),

    Questions('какавелла',
        {
          'измельчённая шелуха семян какао':true,
          'женская причёска, украшенная перьями':false,
          'цыганский гимн':false

        }),

    Questions('квагга',
        {
          'один из видов зебры':true,
          'часть гусеницы танка':false,
          'английская мера объёма':false

        }),

    Questions('кончебас',
        {
          'турецкое гребное одномачтовое судно':true,
          'сладкий слабоалкогольный напиток':false,
          'сельскохозяйственная культура':false

        }),

    Questions('метранпаж',
        {
          'старший работник в типографии':true,
          'представитель обслуживающего персонала в отеле':false,
          'устройство, отмеряющее равные промежутки времени':false

        }),

    Questions('мадаполам',
        {
          'каста высших чиновников в Индии':false,
          'хлопчатобумажная бельевая ткань':true,
          'один из видов тебетского массажа':false

        })
  ];